app/controllers/listpages_controller.rb

SELECT "listpages".* FROM "listpages"
---
  def index
    @listpages = Listpage.all

INSERT INTO "listpages" ("created_at", "csvname", "details_pages", "keyword", "link_get_attribute", "link_get_tag", "link_get_value", "name", "paging_add", "paging_max", "paging_parameter", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @listpage = Listpage.new(listpage_params)

    respond_to do |format|
      if @listpage.save

SELECT "listpages".* FROM "listpages" WHERE "listpages"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_listpage
      @listpage = Listpage.find(params[:id])